import noGeniza from './no-geniza'

it('replaces Elo-him with א-להים', () => {
  expect(
    noGeniza(
      'בְּרֵאשִׁ֖ית בָּרָ֣א אֱלֹהִ֑ים אֵ֥ת הַשָּׁמַ֖יִם וְאֵ֥ת הָאָֽרֶץ׃'
    )
  ).toEqual(
    'בְּרֵאשִׁ֖ית בָּרָ֣א אֱ-לֹהִ֑ים אֵ֥ת הַשָּׁמַ֖יִם וְאֵ֥ת הָאָֽרֶץ׃'
  )
})

it('transforms multiple occurrences in same bit of text', () => {
  expect(
    noGeniza(
      'וַיַּ֧רְא אֱלֹהִ֛ים אֶת־הָא֖וֹר כִּי־ט֑וֹב וַיַּבְדֵּ֣ל אֱלֹהִ֔ים בֵּ֥ין הָא֖וֹר וּבֵ֥ין הַחֹֽשֶׁךְ׃'
    )
  ).toEqual(
    'וַיַּ֧רְא אֱ-לֹהִ֛ים אֶת־הָא֖וֹר כִּי־ט֑וֹב וַיַּבְדֵּ֣ל אֱ-לֹהִ֔ים בֵּ֥ין הָא֖וֹר וּבֵ֥ין הַחֹֽשֶׁךְ׃'
  )
})

it('replaces tetragram with ה׳', () => {
  expect(noGeniza('ויעש נח ככל אשר־צוהו יהוה')).toEqual(
    'ויעש נח ככל אשר־צוהו ה׳'
  )
})

it('replaces tetragram (& nikkud) with ה׳', () => {
  expect(
    noGeniza('וַיַּ֖עַשׂ נֹ֑חַ כְּכֹ֥ל אֲשֶׁר־צִוָּ֖הוּ יְהֹוָֽה׃')
  ).toEqual('וַיַּ֖עַשׂ נֹ֑חַ כְּכֹ֥ל אֲשֶׁר־צִוָּ֖הוּ ה׳׃')
})

it('replaces Elo-hei with א-להי', () => {
  expect(noGeniza('וַיֹּ֗אמֶר אָנֹכִי֙ אֱלֹהֵ֣י אָבִ֔יךָ')).toEqual(
    'וַיֹּ֗אמֶר אָנֹכִי֙ אֱ-לֹהֵ֣י אָבִ֔יךָ'
  )
})
